---
kind: method
id: M:Autodesk.Revit.DB.Frame.#ctor
source: html/c7377867-7820-d794-dc11-83dae15a3a19.htm
---
# Autodesk.Revit.DB.Frame.#ctor Method

Default constructor. Uses global origin and standard basis vectors.

## Syntax (C#)
```csharp
public Frame()
```